app/Controllers/Guru_Staf.php

    public function index()
    {
        $sesi = \Config\Services::session();

        $data['data'] = $this->db->table('tb_guru_staf')->get()->getResult();
---
SELECT *
FROM `tb_guru_staf`