app/Controllers/Kas_Keluar.php

    public function index()
    {
        $data['data'] = $this->db->table('tb_kas_keluar')->get()->getResult();
---
SELECT *
FROM `tb_kas_keluar`